# 0.0 Questions CEO 03

1. Qual é o número de imóveis por ano de construção?

2. Qual é o menor número de quartos por ano da construção de imóveis?

3. Qual é preço de compra mais altopor cada número de quartos?

4. Qual é a soma de todos os preços de compra por número de quartos?

5. Qual é soma de todos os preços de compra por número de quartos e banheiros?

6. Qual é o tamanho médio das salas por ano de construção?

7. Qual é o tamanho mediano das salas dos imóveis por ano da construção?

8. Qual é o desvio padrão das salas dos imóveis por ano de construção?

9. Como é o crescimento médio de preços por ano, por dia e por semana do ano?

10. Eu gostaria de olhar o mapa e olhar as casas com maiores preços.

# 0.1 Planejamento da Solução

1. Qual é o número de imóveis por ano de construção?
- contar os número de id por ano da construções
_________________________________________________________________________________________
2. Qual é o menor número de quartos por ano da construção de imóveis?
-  agrupar os dados dos anos e procurar o menor valor 
________________________________________________________________________________________
3. Qual é preço de compra mais alto por cada número de quartos?
-  agrupar os dados do preço e quartos e achar o valor mais alto

_________________________________________________________________
4. Qual é a soma de todos os preços de compra por número de quartos?
- agrupar todos os preços e quartos e somar

_________________________________________________

5. Qual é soma de todos os preços de compra por número de quartos e banheiros?
- agrupar os dados de preço, quartos e banheiros e somar
_____________________________________________________________
6. Qual é o tamanho médio das salas por ano de construção?
- agrupar os anos e coluna das salas fazer a média do M2 das salas?
_________________________________________________________________________

7. Qual é o tamanho mediano das salas dos imóveis por ano da construção?
- Fazer a mediana das coluna das salas e agruar os dados por ano?
________________________________________________________________________

8. Qual é o desvio padrão das salas dos imóveis por ano de construção?
-  agrupar os dados da coluna da sala por ano e usar função desvio padrão
_____________________________________________________________________________
9. Como é o crescimento médio de preços por ano, por dia e por semana do ano?
-  agrupar os preços por período e achar uma biblioteca que faça um gráfico por em linha para pecorrer o tempo
________________________________________________________________________________
10. Eu gostaria de olhar o mapa e olhar as casas com maiores preços.
- Achar uma biblioteca que faça um mapa em html

# 0.2 - IMPORTS

In [3]:
import pandas as pd
import numpy as np

# 0.3 - CARREGANDO OS DADOS

In [5]:
df1= pd.read_csv('./kc_house_data.csv')

In [13]:
df1.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [14]:
df1.sample()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
779,1954700695,2014-06-12,2250000.0,5,4.25,4860,9453,1.5,0,1,...,10,3100,1760,1905,0,98112,47.6196,-122.286,3150,8557

# 0.4 - Types of Date

In [8]:
df1.dtypes

id                 int64
date              object
price            float64
bedrooms           int64
bathrooms        float64
sqft_living        int64
sqft_lot           int64
floors           float64
waterfront         int64
view               int64
condition          int64
grade              int64
sqft_above         int64
sqft_basement      int64
yr_built           int64
yr_renovated       int64
zipcode            int64
lat              float64
long             float64
sqft_living15      int64
sqft_lot15         int64
dtype: object

# 0.5 - CONVERTANDOS OS TIPOS

In [10]:
df1['date']= pd.to_datetime(df1['date'])

In [11]:
df1.dtypes

id                        int64
date             datetime64[ns]
price                   float64
bedrooms                  int64
bathrooms               float64
sqft_living               int64
sqft_lot                  int64
floors                  float64
waterfront                int64
view                      int64
condition                 int64
grade                     int64
sqft_above                int64
sqft_basement             int64
yr_built                  int64
yr_renovated              int64
zipcode                   int64
lat                     float64
long                    float64
sqft_living15             int64
sqft_lot15                int64
dtype: object

In [38]:
df1['year']= df1['date'].dt.year

In [39]:
df1.sample()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,year
3250,1951100110,2015-02-05,240000.0,3,1.75,1630,9450,1.0,0,0,...,1080,550,1977,0,98032,47.3729,-122.295,1280,9100,2015

# 1. Qual é o número de imóveis por ano de construção?

In [56]:
#contar os número de id por ano da construções
aux1= df1[['id','yr_built',]].groupby('yr_built').count()

In [57]:
aux1

           id
yr_built
1900       87
1901       29
1902       27
1903       46
1904       45
...       ...
2011      130
2012      170
2013      201
2014      559
2015       38

[116 rows x 1 columns]

# 2. Qual é o menor número de quartos por ano da construção de imóveis?
- agrupar os dados dos anos e quartos e procurar o menor valor

In [64]:
df1[['yr_built','bedrooms']].groupby('yr_built').min()

          bedrooms
yr_built
1900             1
1901             2
1902             2
1903             1
1904             2
...            ...
2011             1
2012             2
2013             2
2014             1
2015             1

[116 rows x 1 columns]

# 3. Qual é preço de compra mais alto por cada número de quartos?
- agrupar os dados do preço e quartos e achar o valor mais alto

In [69]:
df1[['price','bedrooms']].groupby('bedrooms').max()

              price
bedrooms
0         1295650.0
1         1247000.0
2         3278000.0
3         3800000.0
4         4489000.0
5         7062500.0
6         7700000.0
7         3200000.0
8         3300000.0
9         1400000.0
10        1148000.0
11         520000.0
33         640000.0

# 4. Qual é a soma de todos os preços de compra por número de quartos?
- agrupar todos os preços e quartos e somar

In [68]:
df1[['price','bedrooms']].groupby('bedrooms').sum()

                 price
bedrooms
0         5.323550e+06
1         6.321093e+07
2         1.107789e+09
3         4.580264e+09
4         4.372957e+09
5         1.259346e+09
6         2.245416e+08
7         3.614502e+07
8         1.436600e+07
9         5.363999e+06
10        2.458000e+06
11        5.200000e+05
33        6.400000e+05

# 5. Qual é soma de todos os preços de compra por número de quartos e banheiros?
- agrupar os dados de preço, quartos e banheiros e somar

In [74]:
df1[['price','bedrooms','bathrooms']].groupby(['bedrooms','bathrooms']).sum()

                        price
bedrooms bathrooms
0        0.00       3642600.0
         0.75        265000.0
         1.00        228000.0
         1.50        288000.0
         2.50        899950.0
...                       ...
10       2.00        650000.0
         3.00        660000.0
         5.25       1148000.0
11       3.00        520000.0
33       1.75        640000.0

[144 rows x 1 columns]

# 6. Qual é o tamanho médio das salas por ano de construção?
- agrupar os anos e coluna das salas fazer a média do M2 das sal

In [79]:
df1[['yr_built','sqft_living']].groupby('yr_built').mean()

          sqft_living
yr_built
1900      1732.011494
1901      1763.620690
1902      1919.629630
1903      1507.739130
1904      1603.177778
...               ...
2011      2313.684615
2012      2378.741176
2013      2636.592040
2014      2615.389982
2015      2596.315789

[116 rows x 1 columns]

# 7. Qual é o tamanho mediano das salas dos imóveis por ano da construção?
- Fazer a mediana das coluna das salas e agruar os dados por ano?

In [83]:
df1[['yr_built','sqft_living']].groupby('yr_built').median()

          sqft_living
yr_built
1900           1540.0
1901           1610.0
1902           1600.0
1903           1505.0
1904           1280.0
...               ...
2011           2270.0
2012           2237.5
2013           2580.0
2014           2650.0
2015           2590.0

[116 rows x 1 columns]